# StairsLandingtypeTreadriserType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsLandingtypeTreadriserType Property
ParameterTypeId Class See Also
---
"Type": Tread/Riser Type
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsLandingtypeTreadriserType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsLandingtypeTreadriserType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsLandingtypeTreadriserType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace